using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Poll
{
    class Poll
    {
        static void Main(string[] args)
        {
            // За изминалата година бе направена анкета, сред програмистите в световен мащаб, кои са 10 - те най - използвани езици за програмиране.
            // Задачата ни е при въведено от конзолата число N,
            // отговарящо на броя гласували в анкетата и число Х гласували за 1 - вия в класацията да пресметнем дали първите три езика в класацията са с повече гласове от половината гласове
            // и ако това е така, с колко са повече, както и ако са с по-малко, с колко по - малко са.
            // Нека се има в предвид, че езикът на второ място има 20 % по - малко гласове от езикът на първо, а пък от своя страна езикът на трето място има 10 % по - малко гласове от езикът
            // на второ място.

            //Вход
            //Входът се чете от конзолата и съдържа точно 2 реда:
            //• На първия ред е броят на участвалите в анкетата – цяло число в интервала[0..10000]
            //• На втория ред е броят гласували за езикът на първо място - цяло число в интервала[0...9999]

            //Изход
            //На конзолата се отпечатва 1 ред, който изглежда по следния начин:
            //• Ако първите три езика имат повече или равни на половината гласове:
            //            "First three languages have {гласове повече от половината} votes more"
            //• Ако първите три езика имат по-малко от половината гласове:
            //            "First three languages have {гласове по-малко от половината} votes less of half votes"


            int n = int.Parse(Console.ReadLine());
            int x = int.Parse(Console.ReadLine());
            double y = x * 0.8;
            double z = y * 0.9;

            if (x + y + z >= n/2)
            {
                Console.WriteLine($"First three languages have {Math.Ceiling((x+y+z) - n/2)} votes more");
            }
            else
            {
                Console.WriteLine($"First three languages have {Math.Ceiling(n / 2 - (x + y + z))} votes less than half votes");
            }

        }
    }
}
